{
    "personalInfo": {
      "name": "Saood Imran",
      "tagline": "Software Developer",
      "email": "saood.imran.office@gmail.com",
      "linkedin": "https://www.linkedin.com/in/saood-imran-0b1280246/",
      "github": "https://github.com/SaoodImran123",
      "website": "https://saoodimran123.github.io/",
      "profilePicture": "/photo-1.jpg"
    },
    "summary": "Full Stack Developer with experience building responsive web applications, developing scheduling tools, and automating business workflows. Skilled in React, Node.js, SQL, and data integration. Proven track record of collaborating in cross-functional teams to build tools that support decision making in fast-paced environments",
    "experience": [
      {
        "title": "Associate",
        "company": "Infosys",
        "location": "Mississauga, ON",
        "years": "10/2022 – 10/2023",
        "description": [
          "Developed front and backend components for InfyInsurance, a multi-role web app used by patients, providers, and insurers, using Java Spring Boot, PostgreSQL, and Angular",
          "Optimized old database tables and queries in PostgreSQL, reducing latency by 2-300% for certain requests",
          "Built and documented RESTful APIs to support claims processing, benefit lookups, and policy administration across user groups",
          "Delivered enhancements to internal tools (e.g., job posting portal, FAQ dashboard, internal query submission app) that improved usability and reduced manual queries",
          "Collaborated in an Agile team of 6–8 developers, regularly participating in sprint planning, code reviews, and demos to iterate on business requirements."
        ],
        "companyLogo": ""
      },
      {
        "title": "Software Engineer (Internship)",
        "company": "Ontario Power Generation",
        "location": "Bowmanville, ON",
        "years": "07/2020 - 07/2021",
        "description": [
          "Developed spent fuel analysis tool (python) to re-organize and future-proof multiple radioactive fuel bays minimize extraction costs reach decommissioning targets",
          "Reduced operational overhead by 90% through automation of daily reporting workflows and document generation, saving $250,000 over 10 years.",
          "Implemented intelligent sorting algorithm for large datasets to handle complex stacking dependencies (6-layer deep storage) and time-based removal requirements, optimizing throughput while preventing future bottlenecks in extraction plans",
          "Led full project lifecycle including stakeholder meetings, technical architecture decisions, and full-stack development for my main project",
          "Collaborated with people from various disciplines and backgrounds effectively, to manage projects and introduce new Software and Technology as apart of the Innovation department"
        ],
        "companyLogo": ""
      }
    ],
    "education": [
      {
        "degree": "Bachelor of Engineering",
        "institution": "Ontario Technology University",
        "location": "Oshawa, ON",
        "years": "04/2022",
        "details": "",
        "institutionLogo": ""
      }
    ],
    "skills": [
      "Python", 
      "JavaScript", 
      "HTML5", 
      "CSS",
      "React", 
      "Next.js", 
      "Node.js", 
      "Express.js",
      "PostgreSQL",
      "Redis",
      "MongoDB", 
      "MySQL",
      "AWS", 
      "Git",
      "Kafka",
      "ZooKeeper",
      "Docker"
    ],
    "projects": [
            {
            "name": "Oshawa Hub",
            "description": "Built a containerized data pipeline to display and track real-time Air Quality Health Index and Weather data from various sensors across Oshawa",
            "technologies": [],
            "link": "https://github.com/SaoodImran123",
            "demo": "",
            "image": "/Oshawa-Hub.png"
        },
    {
            "name": "AniRename",
            "description": "Engineered an open-source Python-based desktop app to automate anime media library organization through renaming and organizing files into appropriate folders via AniDB integration",
            "technologies": [],
            "link": "https://github.com/SaoodImran123",
            "demo": "",
            "image": "/Ani-Renamer.png"
        },
      {
        "name": "Admin Dashboard",
        "description": "Built a professional-grade admin dashboard for Autumnae Shop to enable order and product management along with sale metrics",
        "technologies": [],
        "link": "https://github.com/SaoodImran123",
        "demo": "",
        "image": "/Admin-Dashboard.png"
      },
      {
        "name": "Autumnae Shop",
        "description": "Architecting a mobile-first e-commerce platform using Next.js, Supabase, Express, and Stripe, with a focus on secure transactions, dynamic product management, and an intuitive admin dashboard.",
        "technologies": [],
        "link": "https://github.com/SaoodImran123",
        "demo": "",
        "image": "/Autumnae-Frontend.png"
      },
      {
        "name": "Wordle App",
        "description": "Designed an aesthetic Wordle app that uses the public Wordle API to allow users to play the daily wordle challenge. Features an on-screen keyboard for users using different devices.",
        "technologies": [],
        "link": "https://github.com/SaoodImran123/WordleApp",
        "demo": "",
        "image": "/Wordle-App.png"
      },
      {
        "name": "Mirror",
        "description": "A webRTC voice-calling and streaming app. Allows communication via voice, text, and video. Allows creation of channels and to host meetings similar to Zoom. Rooms accessed via codes given to authorized users.",
        "technologies": [],
        "link": "https://github.com/SaoodImran123/Mirror",
        "demo": "",
        "image": "/Mirror.png"
      },
      {
        "name": "MovieZen",
        "description": "Developed an AI-powered movie recommendation platform, combining chatbot-driven conversations with sentiment analysis algorithms to personalize recommendations and drive engagement.",
        "technologies": [],
        "link": "https://github.com/SaoodImran123/movie-chatbot"
      }
    ]
  } 
