{
    "personalInfo": {
      "name": "Saood Imran",
      "tagline": "Software Developer",
      "email": "saood.imran.office@gmail.com",
      "linkedin": "https://www.linkedin.com/in/saood-imran-0b1280246/",
      "github": "https://github.com/SaoodImran123",
      "website": "https://saoodimran123.github.io/",
      "profilePicture": "/photo-1.jpg"
    },
    "summary": "Full Stack Developer with experience building responsive web applications, developing scheduling tools, and automating business workflows. Skilled in React, Node.js, SQL, and data integration. Proven track record of collaborating in cross-functional teams to build tools that support decision making in fast-paced environments",
    "experience": [
      {
        "title": "Associate",
        "company": "Infosys",
        "location": "Mississauga, ON",
        "years": "10/2022 – 10/2023",
        "description": [
          "Developed and deployed multiple web apps/features such as Job boards, FAQ's, dashboards, InfyHealth components while working in a large multi-functional team",
          "Built new and optimized old databases/queries, reducing latency by 500% for certain data displays}",
          "Built APIs / wrote business logic in Java/Python for PostgreSQL, MongoDB, and Redis databases used in internal projects",
          "Collaborated across the full SDLC using Git, Agile, and stakeholder feedback to ensure delivery of business-aligned features.",
          "Completed Infosys courses/certs for Cloud providers such as AWS and GCP"
        ],
        "companyLogo": ""
      },
      {
        "title": "Software Engineer (Internship)",
        "company": "Ontario Power Generation",
        "location": "Bowmanville, ON",
        "years": "07/2020 - 07/2021",
        "description": [
          "Developed spent fuel analysis tool to re-organize and future-proof multiple radioactive fuel bays with extraction costs and decommissioning targets in mind",
          "Developed Web Apps and ETL pipelines to process and transform data into actionable reports ready to be signed off by decision makers",
          "Drove full project lifecycle including stakeholder meetings, technical architecture decisions, and full-stack development",
          "Trained end-users on new technology and digital tools by creating walkthroughs and documentation, facilitating smoother onboarding and tool adoption.",
          "Effectively communicated technical concepts to multidisciplinary teams and pitched new digital solutions to non-technical executives."
        ],
        "companyLogo": ""
      }
    ],
    "education": [
      {
        "degree": "Bachelor of Engineering",
        "institution": "Ontario Technology University",
        "location": "Oshawa, ON",
        "years": "04/2022",
        "details": "",
        "institutionLogo": ""
      }
    ],
    "skills": [
      "Python", 
      "JavaScript", 
      "HTML5", 
      "CSS",
      "React", 
      "Next.js", 
      "Node.js", 
      "Express.js",
      "PostgreSQL",
      "Redis",
      "MongoDB", 
      "MySQL",
      "AWS", 
      "Git",
      "Kafka",
      "ZooKeeper",
      "Docker",
    ],
    "projects": [
            {
            "name": "Oshawa Hub",
            "description": "Built a containerized data pipeline to display and track real-time Air Quality Health Index and Weather data from various sensors across Oshawa",
            "technologies": [],
            "link": "https://github.com/SaoodImran123",
            "demo": "",
        },
    {
            "name": "AniRename",
            "description": "Engineered an open-source Python-based desktop app to automate anime media library organization through renaming and organizing files into appropriate folders via AniDB integration",
            "technologies": [],
            "link": "https://github.com/SaoodImran123",
            "demo": "",
            "image": "/Ani-Renamer.png"
        },
      {
        "name": "Admin Dashboard",
        "description": "Built a professional-grade admin dashboard for Autumnae Shop to enable order and product management along with sale metrics",
        "technologies": [],
        "link": "https://github.com/SaoodImran123",
        "demo": "",
        "image": "/Admin-Dashboard.png"
      },
      {
        "name": "Autumnae Shop",
        "description": "Architecting a mobile-first e-commerce platform using Next.js, Supabase, Express, and Stripe, with a focus on secure transactions, dynamic product management, and an intuitive admin dashboard.",
        "technologies": [],
        "link": "https://github.com/SaoodImran123",
        "demo": "",
        "image": "/Autumnae-Frontend.png"
      },
      {
        "name": "Wordle App",
        "description": "Designed an aesthetic Wordle app that uses the public Wordle API to allow users to play the daily wordle challenge. Features an on-screen keyboard for users using different devices.",
        "technologies": [],
        "link": "https://github.com/SaoodImran123/WordleApp",
        "demo": "",
        "image": "/Wordle-App.png"
      },
      {
        "name": "Mirror",
        "description": "A webRTC voice-calling and streaming app. Allows communication via voice, text, and video. Allows creation of channels and to host meetings similar to Zoom. Rooms accessed via codes given to authorized users.",
        "technologies": [],
        "link": "https://github.com/SaoodImran123/Mirror",
        "demo": "",
        "image": "/Mirror.png"
      },
      {
        "name": "MovieZen",
        "description": "Developed an AI-powered movie recommendation platform, combining chatbot-driven conversations with sentiment analysis algorithms to personalize recommendations and drive engagement.",
        "technologies": [],
        "link": "https://github.com/SaoodImran123/movie-chatbot"
      }
    ]
  } 
